; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v4 - type_3 ?v6 - type_1)
 	      (pred_2 ?v3 - object ?v6 - type_1)
	      (pred_3 ?v4 - type_3 ?v7 - type_2)
	      (pred_1 ?v4 - type_3 ?v3 - object ?v7 - type_2))

   (:action op_3
       :parameters  (?v4 - type_3 ?v2 ?v1 - type_1)
       :precondition (and  (pred_4 ?v4 ?v2))
       :effect (and  (pred_4 ?v4 ?v1)
		     (not (pred_4 ?v4 ?v2))))

   (:action op_1
       :parameters (?v4 - type_3 ?v8 - object ?v5 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v5) (pred_4 ?v4 ?v5) (pred_3 ?v4 ?v7))
       :effect (and (pred_1 ?v4 ?v8 ?v7)
		    (not (pred_2 ?v8 ?v5)) 
		    (not (pred_3 ?v4 ?v7))))

   (:action op_2
       :parameters (?v4 - type_3 ?v8 - object ?v5 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v8 ?v7) (pred_4 ?v4 ?v5))
       :effect (and (pred_2 ?v8 ?v5)
		    (pred_3 ?v4 ?v7)
		    (not (pred_1 ?v4 ?v8 ?v7)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_05 - type_3
obj_03 obj_09 - type_2
obj_07 obj_06 obj_08 - type_1
obj_04 obj_02 obj_01 - object)
(:init
(pred_4 obj_05 obj_06)
(pred_3 obj_05 obj_03)
(pred_3 obj_05 obj_09)
(pred_2 obj_04 obj_06)
(pred_2 obj_02 obj_07)
(pred_2 obj_01 obj_06)
)
(:goal
(and
(pred_2 obj_04 obj_06)
(pred_2 obj_02 obj_06)
(pred_2 obj_01 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_05 ?b obj_09))))
)
)

; plan
1. (op_1 obj_05 obj_01 obj_06 obj_03)
   deleted: (pred_2 obj_01 obj_06) (pred_3 obj_05 obj_03)
   added: (pred_1 obj_05 obj_01 obj_03)
   goals met: 1 of 3
2. (op_3 obj_05 obj_06 obj_07)
   deleted: (pred_4 obj_05 obj_06)
   added: (pred_4 obj_05 obj_07)
   goals met: 1 of 3
3. (op_2 obj_05 obj_01 obj_07 obj_03)
   deleted: (pred_1 obj_05 obj_01 obj_03)
   added: (pred_2 obj_01 obj_07) (pred_3 obj_05 obj_03)
   goals met: 2 of 3
4. (op_1 obj_05 obj_02 obj_07 obj_03)
   deleted: (pred_2 obj_02 obj_07) (pred_3 obj_05 obj_03)
   added: (pred_1 obj_05 obj_02 obj_03)
   goals met: 2 of 3
5. (op_3 obj_05 obj_07 obj_06)
   deleted: (pred_4 obj_05 obj_07)
   added: (pred_4 obj_05 obj_06)
   goals met: 2 of 3
6. (op_2 obj_05 obj_02 obj_06 obj_03)
   deleted: (pred_1 obj_05 obj_02 obj_03)
   added: (pred_2 obj_02 obj_06) (pred_3 obj_05 obj_03)
   goals met: 3 of 3
